---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSetIterator.#ctor
source: html/625d9a1a-a7a0-a7e5-ee4a-0c829f66f1e3.htm
---
# Autodesk.Revit.DB.CurtainGridSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public CurtainGridSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.